[
  "I think we both know the answer to that.",
  "Get here first? The Covenant ships have always been faster. As for tracking us all the way from Reach, at lightspeed, my maneuvering options were limited.",
  "Until we decelerated, no one could have missed that hole we tore in Slipspace.",
  "They were waiting for us on the far side of the planet.",
  "Our fighters are mopping up the last of their recon picket now, nothing serious; but I've isolated approach signatures from multiple CCS-class battle groups, make it three capital ships per group. And, in about 90 seconds, they'll be all over us.",
  "Everyone, sir?",
  "I've already begun.",
  "A dozen Covenant superior battleships against a single Halcyon-class light cruiser. Given those odds, I'm content with three ... make that four kills.",
  "Sleep well?",
  "So you did miss me.",
  "It must've been one of their boarding parties! I'd guess an antimatter charge.",
  "Captain, the cannon was my last defensive option.",
  "While you do what, go down with the ship?",
  "With all due respect, sir, this war has enough dead heroes.",
  "The Autumn will continue evasive maneuvers until you initiate a landing sequence. Not that you'll listen, but I'd suggest letting my subroutines handle the final approach.",
  "...Yank me.",
  "Your architecture isn't much different from the Autumn's...",
  " What the hell are you doing?",
  "Security to the bridge, the Master Chief has gone rampant! Take him down, boys.",
  "Keep your head down! There's two of us in here now, remember?",
  "The damage to the superstructure is extensive...I don't know how much more abuse the Autumn can take!",
  "Now would be a very good time to leave!",
  "Look!",
  "I knew it. The Autumn is accelerating; Keyes is going in manually!",
  "Sure you wouldn't rather take a seat?",
  "If I still had fingers, they'd be crossed...",
  "I'm reading thousands of types of flora. The ring's ecosystem is incredibly sophisticated.",
  "This cave is not a natural formation. Someone built it, so it must lead somewhere. I've hacked into the Covenant Battlenet. They're actually broadcasting tactical data on unencrypted channels. We should show them who they're dealing with. Master Chief? I'm going to use your suit's transponder system to monitor their chatter.",
  "New traffic on the Covenant Battlenet...a lot more crew made it off the Autumn than I had predicted—the Captain really gave them hell! If we can find Captain Keyes and other survivors, we have a chance to coordinate an effective resistance.",
  "New traffic on the Covenant Battlenet! I've found Captain Keyes! He's being held on a Covenant cruiser, the Truth and Reconciliation, a ship I disabled before we abandoned the Autumn. The Truth and Reconciliation touched down on a desert plateau roughly three hundred kilometers up spin.",
  "There's our ride. Get aboard, and let's get out of here.",
  "The enemy has captured Captain Keyes, and are holding him aboard one of their cruisers, the Truth and Reconciliation. The ship is currently holding position approximately three hundred meters above the other end of this plateau.",
  "Covenant forces detected up ahead. The path up on the left should let us sneak up around them.",
  "The Covenant use a Gravity Lift to ferry troops and supplies between the ship and the surface. We need to ambush them at the loading zone, and use the lift to enter the ship.",
  "We're in. I've got a good lock on the Captain's CNI transponder. No Covenant defenses detected.",
  "Chief, let's see if we can find a way to open this door.",
  "I'd like to see you crack a 128,000-bit modulating encryption key.",
  "One moment, sir. Accessing Covenant Battlenet. According to the data in their networks, the ring has some kind of deep religious significance. If I'm analyzing this correctly...they believe that Halo is some kind of weapon. One with vast, unimaginable power.",
  "Now I see...I have intercepted a number of messages about a Covenant search team, scouting for a 'Control Room'. I thought they were looking for the bridge of a cruiser I damaged in the battle above the ring. But they must be looking for Halo's control room.",
  "The Covenant believe that what they call 'The Silent Cartographer' is somewhere under this island. The Cartographer is a map room that will lead us to Halo's Control Center. The island has multiple structures and installations and one of them contains the map room.",
  "There, in the cliff wall. I'll bet the Silent Cartographer is somewhere inside that facility.",
  "They're already inside! We need to get in there quick, before they discover the location of Halo's Control Center!",
  "The Covenant are putting up a real fight! Cartographer must be here. My analysis indicates that the map room should be at the bottom floor of this facility. Let's keep going inside.",
  "Don't let them lock the doors!",
  "Interesting. I underestimated the Covenant's understanding of Halo's subsystems. They've locked the doors, and we don't have enough firepower to get through them. Cortana to Captain Keyes.",
  "This isn't the map room. Analyzing... This is a Security Override Station for the main facility, located somewhere else on this island. Shut the system down so the Covenant won't be able to lock us out.",
  "Chief, Bravo 22 was bringing us some heavy weapons. After I saw we were up against Hunters, I thought you could use them. Let's move down the beach. Keep an eye out for any cargo we can salvage.",
  "It'll be easier to hold them off from inside the structure. Can you get inside?",
  "Analyzing. Halo's Control Center is located there. That structure appears to be some sort of temple or shrine, if I've interpreted this correctly. Interesting. A shrine is an unlikely place to put such a significant installation. Cortana to Captain Keyes.",
  "Keep trying. Let me know when you've reestablished contact, and then tell him that the Master Chief and I have determined the location of the Control Center. We'll be heading there as soon as we're topside.",
  "Let's get moving. Foe Hammer. Here are coordinates and a flight plan I've worked out.",
  "The Covenant did a thorough seismic scan. My analysis shows that Halo is honeycombed with deep tunnels, which circle the whole ring.",
  "Look on the bright side, Foe Hammer: The last thing the Covenant will expect is an aerial insertion...from underground.",
  "The Covenant presence here is stronger than I anticipated. They seem to have the entire region secured.",
  "Interesting... the weather patterns here seem natural, not artificial. I wonder if the ring's environment systems are malfunctioning... or if the designers wanted the installation to have inclement weather.",
  "I thought the Covenant had eliminated all the Marine forces in this area.",
  "We need to get up this ridge. Marines, hold your positions. We'll handle those guns. Master Chief, we should scale the ridge and get below those stationary guns.",
  "Resistance appears to be increasing. We must be close to the Control Center.",
  "Analyzing. This must be the Control Room. Subtle. The entrance to the Control Room is at the top of that pyramid structure. Bring me up there and I should be able to get us inside.",
  "This is it: Halo's Control Center.",
  "That terminal, try there.",
  "Never been better...you can't imagine the wealth of information. Knowledge...so much...so fast. It's glorious!",
  "What are you talking about?",
  "This ring isn't a cudgel, you barbarian: it's something else...something much more important. The Covenant were right...this ring...it's Forerunner. Give me a second to access... Yes, the Forerunners built this place, what they called a 'fortress world,' in order to... No, that can't be. Oh, those Covenant fools, they must have known; there must have been signs!",
  "The Covenant found something, buried in this ring, something horrible, and now...they're afraid.",
  "The weapons cache he's looking for. It's not really -.. We can't let him get inside!",
  "There's no time. Get out of here, find Keyes, stop him! Before it's too late!",
  "I've spent the last 12 hours cooped up in here, watching you toady about, helping that thing get set to slit our throats!",
  "Oh? I didn't realize. He's your pal, is he? Your chum? Do you have any idea what that bastard almost made you do?!",
  "You sure that's a good idea?",
  "Do what? I have the Index! You can just float and sputter!",
  "You have no idea how this ring works, do you? Why the Forerunners built it? Halo doesn't kill Flood, it kills their food: Humans, Covenant, whatever—we're all equally edible. The only way to stop the Flood is to starve them to death. And that's exactly what Halo is designed to do: wipe the galaxy clean of all sentient life. You don't believe me? Ask him.",
  "Left out that little detail, did he?",
  "Chief, I'm picking up movement!",
  "We need to go, right now.",
  "We can't let the Monitor activate Halo. We have to stop him. We have to destroy Halo. According to my analysis of the available data, I believe the best course of action is somewhat... risky. An explosion of sufficient size will help destabilize the ring, and will cut through a number of primary systems; we need to trigger a detonation on a large scale, however. A star ship's fusion reactors going critical would do the job. I'm going to search what's left of the Covenant Battlenet, and see if I can locate the Pillar of Autumn's crash-site. If the ship's fusion reactors are still relatively intact, we can use them to destroy Halo.",
  "That's the pulse generator. The center core is the signal amplifier. That's what we need to shut down. We need to interrupt the pulse generator's energy stream. I've adjusted your shield system so that it will deliver an EMP burst to disrupt the Generator. You will need to walk into the beam to trigger it. The EMP blast should neutralize the generator; but it will also drain your shields, and you will be vulnerable until they recharge.",
  "I've located the Pillar of Autumn. She put down twelve-hundred kilometers upspin. Energy readings show her fusion reactors are still powered up. The systems on the Pillar of Autumn have fail safes that even I can't override, without authorization from the Captain. We'll need to find him or his neural implants, to start the fusion core detonation. One target remaining. Let's take care of the final pulse generator.",
  "No, that'll take too long.",
  "There's a teleportation grid that runs throughout Halo. That's how the Monitor moves about so quickly. I learned how to tap into the grid when I was in the Control Room. Unfortunately, each jump requires a rather consequential expenditure of energy.",
  "But I'm pretty sure I can take the needed energy from your suit without permanently damaging your shields; needless to say, I think we should only try this once.",
  "The Covenant network is in absolute chaos! From what I've been able to piece together, their leadership ordered all ships to abandon Halo when they found the Flood, but they were too late. The Flood overwhelmed this cruiser and disabled it. The Covenant are terrified the Flood will repair the ship and use it to escape from Halo. They've sent in a strike team to kill the Flood and repair the ship for immediate departure. I've got a good lock on Captain Keyes' CNI transponder signal! He's alive! And the implants are intact! There's some interference from the cruiser's damaged reactor. I'll bring us in as close as I can.",
  "Oh... I see! Coordinate data needs to be—",
  "Right. Sorry.",
  "Analyzing damage...This hole was caused by some kind of explosive. Very powerful if it tore through a ship's hull. All I detect down there are pools of coolant. We should continue our search somewhere else.",
  "Warning! Threat level increasing!",
  "That jump into the coolant is looking better all the time, Chief!",
  "Trust me! It's deep enough to cushion our fall!",
  "Chief, we need to jump now!",
  "Power source detected. There's the Gravity Lift. It's still operational! That's our way back in!",
  "The Covenant Battlenet is a mess. I can't access the ship's schematics. My records indicate that a shuttle bay should be... Here.",
  "Look, in the corners. The Flood are gathering bodies here.",
  "He's delirious! In pain! We have to find him!",
  "The Captain! His vitals are fading! Please, Chief, hurry!",
  "No human life-signs detected. The Captain! He's one of... them. We can't let the Flood get off this ring! You know what he'd expect... What he'd want us to do.",
  "It's done. I have the code. We should go. We need to get back to the Pillar of Autumn. Let's go back to the shuttle bay and find a ride.",
  "Perfect. Grab one of the escort Banshees, and use it to return to the Pillar of Autumn.",
  "You did that on purpose, didn't you?",
  "I need you to upload me into the control systems. The terminal is located next to the main viewscreen.",
  "I leave home for a few days, and look what happens. This won't take long.",
  "There. That should give us enough time to make it to a lifeboat and put some distance between ourselves and Halo before the detonation.",
  "He's in my data arrays, a local tap!",
  "At least I still have control over the comm channels.",
  "I'm detecting taps throughout the ship, Sentinels most likely. As for the Monitor... he's in Engineering. He must be trying to take the core offline! Even if I could get the countdown restarted ... I don't know what to do.",
  "The ship was heavily damaged when it crashed. Head to the cryochamber. We should be able to get to the engine room through there.",
  "Engine room located. We're here.",
  "Alert! The Monitor has disabled all command access. We can't restart the countdown. The only remaining option is to detonate the ship's fusion reactors. That should do enough damage to destroy Halo. Don't worry, I have access to all of the reactor schematics and procedures. I'll walk you through it. First, we need to pull back the exhaust couplings. That will expose a shaft that leads to the primary fusion drive core.",
  "That did it! The engine's gone critical! Based on the current rate of decay, we should have fifteen minutes to get off the ship. We don't have much time! We should move outside and signal for evac. Accessing schematics . . . there's a service lift at the top of the engine room! It leads to a class-7 service corridor that runs along the ship's dorsal structure. Hurry!",
  "The Pillar of Autumn's engines are going critical, Foe Hammer! Request: Immediate extraction! Approach the crash site and be ready to pick us up at external access junction 4C as soon as you get my signal!",
  "Negative, negative! We have a wildcat destabilization of the ship's fusion core. The engines must have sustained more damage than we thought!",
  "Analyzing! We have six— five minutes before the fusion drives detonate. We need to evac NOW!",
  "Activating final countdown timer. When it reaches zero, the engines will detonate. The explosion will generate a temperature of almost 100,000,000 degrees. Don't be there when it blows.",
  "We won't make it like this; we'll need a vehicle!",
  "Cortana to Echo 419! Request: extraction now, on the double!",
  "Chief, you're going the wrong way! We need to get off the ship.",
  "Wait, stop! This is where Foe Hammer is coming to pick us up. Hold position here.",
  "Cortana to Echo 419! Two Covenant Banshees are approaching on your six! Evade, say again, evade!",
  "She's gone. Calculating alternate escape route. The ship's inventory shows one Longsword fighter still docked in Launch Bay 7. If we move now, we can make it!",
  "We're cutting it close!",
  "Shut them down, we'll need them later.",
  "Fancy a look?",
  "Scanning... Just ... dust and echoes. We are all that's left.",
  "We did what we had to do! For Earth! An entire Covenant armada obliterated, and the Flood! We had no choice. Halo ... It's finished.",
  "Another whisper, sir, near Io. We have probes en route.",
  "You look nice.",
  "Slipspace ruptures directly off our battle cluster.",
  "Fifteen Covenant capital ships holding position just outside the kill-zone.",
  "That explosion came from inside the Athens. Same as the Malta. The Covenant must have brought something with them. A bomb.",
  "Chief, we don't have much time!",
  "Not very much time on the clock, Chief!",
  "Where are you? The bomb is right here!",
  "The clock is ticking Chief, get down here!",
  "Chief, follow up here, next to the bomb!",
  "Ask yourself this question: If what I'm doing right now is helping Cortana keeping this station being blown into tiny, tiny bits?",
  "Just a reminder: Bomb!",
  "If this thing blows up, I'm never talking to you again!",
  "Registering all hostile vessels inside the kill-zone. Thirteen cruisers, two Assault carriers. I'm going loud!",
  "The first carrier completely ignored us, Sir! Blew right through the Malta's debris field and headed straight for Earth!",
  "Just so you know, there are quite a few Elites guarding the bomb. You may need to get creative.",
  "Me. Inside your head. Now.",
  "You don't want to know.",
  "I know what you're thinking, and it's crazy.",
  "Unfortunately for us both ... I like crazy.",
  "Just one question: What if you miss?",
  "Regret is a name, Sergeant. The name of one of the Covenant's religious leaders. A Prophet. He's on that carrier, and he's calling for help.",
  "You all right, Chief?",
  "Hey *knock knock sound*, wake up.",
  "Talk to me, should I start CPR? What's going on?",
  "Blink if you can hear me.",
  "Find a hole, stay put. We'll come to you.",
  "The highest concentration of Covenant ground troops is directly below the carrier. I don't think they want you to get on board.",
  "Cut the chatter! We got trouble.",
  "This tunnel leads up to the bridge. It's full of rats if you know what I mean, but it beats swimming.",
  "I've been analyzing the Covenant tactical chatter. They're surprised, confused... I don't think they expected us to be here. Not... you and me...all of us... Humanity, on Earth. Odd, I know, but it does help explain why they came here with such a small fleet.",
  "The Covenant must be trying to regroup. Don't let them.",
  "Thanks for the tank. He never gets me anything.",
  "That's quite a welcome party.",
  "There are Marines trapped inside that building, Chief. Concentrate on the Wraiths, they're the biggest threat.",
  "There is a Marine Command Post in that building. We'll need to help them deal with that Scarab.",
  "Who's in charge now, Corporal?",
  "It can't go any further this way. We have it trapped.",
  "Chief, we're going to have to board that Scarab.",
  "We can't do anything to the Scarab from here, we need to get inside it.",
  "Careful Chief, that Elite is an Ultra, and those pilots are no pushovers either.",
  "That... is another Halo.",
  "It is. If activated, this ring will cause destruction on a galactic scale.",
  "Hang on to your helmet!",
  "Could we possibly make any more noise?!",
  "I guess so.",
  "Artillery disabled, Sergeant. Landing zone secure ... for the moment.",
  "Let's wait here until our Warthog arrives ... unless you prefer to walk.",
  "There's our ride.",
  "I saw it, too. It looks like a temple. If I were a megalomaniac, and I'm not, that's where I'd be.",
  "The Covenant have control of the bridge ahead. They're going to try to bottle us up on this side of the gorge. The controls to extend the bridge should be in this structure.",
  "Regret's giving a speech—a sermon, to be exact. So far it's the standard Covenant liturgy, but I'll translate if he says anything interesting.",
  "What? You don't want the tank? Okay, we'll leave it for the others.",
  "Transcendence, huh? More like mass suicide.",
  "More like a Sermon to be exact.",
  "You always bring me to such nice places.",
  "Good, still no word about In Amber Clad on the Covenant battlenet. It's odd, the Covenant knew we made landfall, but they don't seem to consider us a very serious threat. Boy, are they in for a big surprise.",
  "Wait, go back.",
  "That's what I thought he said. The Prophet of Regret is planning to activate Halo!",
  "(smugly) Pretty much.",
  "You know, I think the Forerunners built these new structures around the old, to protect them, to honor them. Pure speculation, mind you. I'd need to make a thorough survey to be sure.",
  "I wish I had more time to decipher these inscriptions. The Forerunners revere this place, that much is clear. But was it a temple, or a university... I can't say.",
  "Understood, ma'am.",
  "A Gondola's launching from the far towers. Big surprise, it's full of Covenant reinforcements.",
  "Well, they were nice enough to bring us a ride.",
  "This Gondola won't get us all the way to the main temple, but it'll get us close. Let's get on board.",
  "If you hit the activation switch, it should drive itself.",
  "This lake couldn't have been created by volcanic action, which means it was either built this way on purpose, or was created by some other cataclysmic event. Sorry... were you trying to kill something?",
  "Ah, now, I see. There's a submerged section that connects these towers to the outlying structures. Looks like we're going down. Unless you'd...prefer to swim.",
  "All right, let's see where this elevator goes.",
  "I've intercepted a secure transmission from Regret's Carrier to the something called... High Charity. It seems to be a formal apology to the Prophets of Truth and Mercy. Apparently, Regret jumped the gun when he attacked Earth. He's asking the other Prophets to 'forgive his premature arrival,' arguing that 'no human presence was foretold.' That explains why there were so few ships in his fleet. But it's odd that a Prophet would have such bad intel about his enemy's homeworld.",
  "And people say I've got a big head.",
  "Keep moving. Let's find our way back to the surface.",
  "Regret's carrier just received a response from High Charity. A very well-encrypted message from the Prophet of Truth. Listen to this: 'Your haste has jeopardized the fulfillment of our Covenant, threatened our Grand Design. That you shall be spared a public display of our contempt is thanks only to Mercy and his wise counsel. Truth, Mercy, Regret. Three Prophet Hierarchs. Killing Regret should shake up the Covenant leadership. But, frankly, it sounds like you might be doing Truth a favor.",
  "Great Journey? Doesn't he know what these rings do?",
  "There, another gondola. Looks like it leads straight to the main temple. Not much further now.",
  "So far, so good. We're approaching the main temple now.",
  "That's the largest Covenant fleet I've ever seen.... the largest anyone's ever seen. Get inside the temple and kill Regret, before it can stop us!",
  "There's no time, Chiquotes: ef. Get inside and take care of the Prophet.",
  "The Covenant fleet has launched multiple waves of Phantoms. Too many for me to track... we don't have much time.",
  "There are Honor Guards all over this place! Watch your back.",
  "There's the target, take him out!",
  "His throne's shielding is protecting him. Get in close and do whatever you can.",
  "You've got to get him out of that throne.",
  "Quick, board his throne!",
  "Bad news, Chief: the Phantoms are turning around. The fleet is preparing to fire on OUR position. We need to get out of here.",
  "What...is that?",
  "Brutes! The faster you can kill these Brutes, the better. (John kills one Brute.) They don't have shield generators, but take them out before... it's berserking!",
  "Oh, I don't think so.",
  "Put me down on one of the pedestals near the door.",
  "They've locked it from below. There's a door at the other end of the chamber.",
  "That Prophet, Truth. He has the Index! You've got to take it from him. Let me get these doors. (John reaches for the pedestal) Go! It will be easier to track Truth if I stay in the network.",
  "Don't worry. You can pick me up later.",
  "Watch out for the Captain, it's got a Brute Shot!",
  "Truth is moving through the lower levels of the tower. I'll reverse this grav-lift. Drop down, try to cut him off.",
  "After that stunt on the Cairo, I know you're not afraid of heights.",
  "Fine, I won't watch. Meet you at the bottom, okay?",
  "They're beefing up their patrols. Stay sharp.",
  "Wait a minute! I'm reading Marine IFF transponders. The signals are originating somewhere below your position.",
  "There's another lift in the next room.",
  "Here, Chief. Jump in.",
  "There are two groups of Marines in the detention block. I'll zero in on their locations, you neutralize the guards... quietly.",
  "Chief, come to the lower level. The Marines are just inside, careful of the guards.",
  "Listen up, Marines! John's hunting a Prophet, and you're gonna help him kill it.",
  "We'll get out of here the same way we came in: the central grav-lift.",
  "Excellent! Truth is broadcasting on the move. It'll make him much easier to track.",
  "You wouldn't believe the number of kill-systems the Covenant are throwing down around me. Not to worry, it's pretty sloppy stuff. I guess they never expected a hostile intelligence to penetrate their networks from the inside.",
  "The Covenant just destroyed two of their own ships! And I'm hearing reports of small-arms fire throughout their fleet.",
  "Slipspace rupture. It's In Amber Clad!",
  "If we're going to catch Truth, we'll need to take a shortcut, straight through the Mausoleum. Look on the bright side: for now, they seem much more interested in killing each other.",
  "You might consider sitting this one out.",
  "Hang on! I'm picking up two more transponders. It's the Commander and Johnson! They're closing on Truth's position, Chief. They'll need your help. This way, Chief.",
  "...This isn't good. I’m getting confirmed reports of Flood leaving In Amber Clad's wreckage. Let's get the Index and find a way out of here. Before things get really ugly.",
  "That structure at the center of the city! It's a Forerunner Ship... And Truth is heading straight for it! If he leads the Covenant fleet to Earth, they won't stand a chance. You have to stop him!",
  "No. I don't want to chance a remote detonation. I need to stay here.",
  "Flood controlled dropships are touching down all over the city! That creature beneath the Library... That Gravemind... Used us. We were just a diversion. In Amber Clad was always its intended vector. There's a conduit connecting this tower to the ship. Head back inside. I'll lead you to it.",
  "I'll disable this lift once you reach the top. That'll slow them down... I hope.",
  "I'll do what I can to slow the launch sequence. There's something inside the ship... A presence that's fighting back! For a Covenant construct, it's unusually formidable.",
  "Brute and Elite ships are engaging one another all around High Charity. I'm running out of options, Chief! I can't stall the launch sequence much longer. The next lift will take you up to the conduit. Hurry!",
  "I knew the Covenant was good at re-purposing Forerunner technology, but this is amazing... They've been using the Forerunner Ship's engines as an energy source for the city. The ship isn't so much launching as it is disengaging; uncoupling itself from High Charity's power grid. Stopping Truth, that's all that matters!",
  "You know the plan. You've got to catch Truth, I've got to handle the Index. Go!",
  "I don't want to risk a remote detonation.",
  "Jump in, now!",
  "Chief, when you get to Earth, good luck.",
  "Don't make a girl a promise... If you know you can't keep it....",
  "They let me pick, did I ever tell you that? Choose whichever Spartan I wanted. You know me. I did my research, watched as you became the soldier we needed you to be. Like the others, you were strong and swift and brave. A natural leader. But you had something they didn't. Something no one saw... but me. Can you guess? Luck. Was I wrong?",
  "Don't make a girl a promise... if you know you can't keep it.",
  "Could you sacrifice me to complete your mission? Could you watch me die?",
  "You have been called upon to serve.",
  "You will be the protectors of Earth and all her colonies.",
  "There will be a great deal of hardship on the road ahead.",
  "You will become the best we can make you.",
  "This place will become your home.",
  "This place will become your tomb.",
  "I have defied Gods and Demons...",
  "I am your shield... I am your sword.",
  "This is the way the world ends...",
  "Chief. I can't tell you everything... It's not safe. The Gravemind... It knows I'm in the system...",
  "Chief!",
  "High Charity—the Prophets' holy city—is on...",
  "Chief!",
  "High Charity... The Prophet's' holy city, is on its way to Earth, with an army of Flood. I can't tell you everything. It's not safe. The Gravemind... It knows I'm in the system.",
  "But it doesn't know about the Portal, where it leads. On the other side, there's a solution; a way to stop the Flood, without firing the remaining Halo rings.",
  "Hurry, Chief! The Ark... There isn't much time.",
  "It asked, and I answered. For a moment of safety, I risked damnation on the stars.",
  "I'm a thief... but I keep what I steal.",
  "A collection of lies; that's all I am! Stolen thoughts and memories!",
  "It was the coin's fault! I wanted to make you strong, keep you safe. I'm sorry, I can't...",
  "May I speak with you, please? ... What's your name? It's very nice to meet you!... You like games? So do I.",
  "I'm just my Mother's shadow... don't look at me, don't listen! I'm not who I used to be...",
  "I have walked the edge of the abyss. I have seen your future. And I have learned!",
  "There will be no more sadness, no more anger, no more envy!",
  "This is UNSC A.I. Serial Number CTN0452-9. I am a monument to all your sins.",
  "You found me...",
  "But so much of me is wrong... out of place. You might be too late...",
  "...you...keep it. I do know how to pick 'em!",
  "The Activation Index from the first Halo ring. A little souvenir I hung onto... just in case. Got an escape plan?",
  "Just keep your head down... There's two of us in here now, remember.",
  "Wait, we need to buy some time. This reactor... start a chain reaction. Destroy High Charity.",
  "You hurt it, Chief. But not for long. We need to get to Halo - destroy the Flood once and for all.",
  "I've got a friendly contact! But who would be crazy enough to come in here?",
  "Wait, you two made nice?! What else have you been up to...?",
  "Johnson? Do you have thefrigate?",
  "Safe is better than close, Sergeant Major.",
  "Halo. It's so new, unfinished. I'm not exactly sure what will happen when we fire it.",
  "Head through the cliffs.",
  "The Control Room isn't far!",
  "Where are you going?",
  "Wait, what's that?",
  "How many of these have you found?",
  "Come on, Chief, let's get back on track. The Control Room is outside!",
  "Flood dispersal pods! Control Room's at the top of that tower, Chief, go! ",
  "There should be ramps that lead to the top - check the other side!",
  "Was that the Monitor? You didn't tell me he was here. Well, we are finally doing what he wanted.",
  "Not for long. I'm tracking additional Dispersal Pods. They'll be hitting any minute!",
  "It's trying to rebuild itself on this ring!",
  "Yank me, Chief.",
  "Chief... I'm so sorry.",
  "The Dawn... of course - the Frigate! We still have a chance!",
  "Find the doorway in the cliffs, Chief. The Dawn is on the other side.",
  "Don't let this ring be the end of us, Chief.",
  "Come on, Spartan - go, go, go!",
  "The Dawn is close. We can make it! As long as the ground doesn't fall out from beneath us...",
  "Halo is ripping itself apart!",
  "Hurry, Chief! Don't stop! Charging sequence at 30%...",
  "Gun it, Chief!! Jump!! Floor it, right into the hangar!!",
  "Hang on!",
  "Chief!!",
  "If we don't make it--",
  "It's been an honor serving with you, John.",
  "Chief?! Can you hear me?",
  "I thought I'd lost you, too.",
  "I'm not sure. When Halo fired, it shook itself to pieces. Did a number on the Ark.",
  "The portal couldn't sustain itself.",
  "We made it through just as it collapsed... well, some of us made it.",
  "But you did it. Truth and the Covenant... the Flood... It's finished.",
  "I'll drop a beacon but it'll be a while before anyone finds us. Years, even.",
  "I'll miss you."
]
