[
  "You heard the lady! Move like you've got a purpose!",
  "Men, keep your eyes downrange, fingers on the triggers, and we all come home in one piece. Am I right, Marines?",
  "Once again, it is our job to finish what the flyboys started. We are leaving this ship's platoon, and engaging the Covenant on solid ground. When we meet the enemy, you will rip their skulls from their spines, and toss 'em away, laughin'! Am I right, Marines?",
  "Men, here is where we show those split-chin, squid-head, sons of bitches that they could not have picked a worse enemy than the human race. We are going to blow the hell out of those dumb bugs until we don't have anything left to shoot 'em with! And then, we are going to strangle them with their own living guts! Am I right, Marines?",
  "Men, we led those dumb bugs out to the middle of nowhere to keep 'em from gettin' their filthy claws on Earth. But, we stumbled onto somethin' they're so hot for, that they're scramblin' over each other to get it. Well, I don't care if it's God's own anti-son-of-a-bitch machine, or a giant hula hoop, we're not gonna let 'em have it! What we will let 'em have is a belly full of lead, and a pool of their own blood to drown in! Am I right, Marines?",
  "Uh-huh. Damn right, I am. Now move it out! Double time!",
  "All you greenhorns who wanted to see Covenant up close... this is your lucky day.",
  "It's a mess, sir. We're scattered all over this valley. We called for evac, but until you showed up, I thought we were cooked.",
  "Sure, Cortana. All right ladies, volunteers step up on the double! The rest of you, get to the drop ship.",
  "Watch your mouth, son. This \"stuff\" is your history. It should remind you grunts what we're fightin' to protect.",
  "You ask 'em real nice next time you see 'em, Bisenti. I'm sure they'll be happy to oblige.",
  "Looks like a Covenant patrol. Badass Elite units, all KIA.",
  "Wait here for the Captain and his squad, and get your ass inside.",
  "Boy, you always got a bad feelin' about something--",
  "Mendoza, get your ass back up to Second Squad's position, and find out what the hell is goin' on.",
  "Where's that coming from, Mendoza?",
  "Don't even THINK about it, Marine!",
  "Goddamnit Jenkins, fire your weapon!",
  "C'mere you mother... I'm gonna... Grr... Ah!",
  "Oh, shi—",
  "This is it, baby. Hold me.",
  "Get up, SO I CAN KILL YOU AGAIN!",
  "Roadkill!",
  "Why me...?",
  "School is now in session!",
  "Theres no stopping me!",
  "Say hello to my little friend!",
  "Leave some for me!",
  "You mind not killing my men?!",
  "You monkeys almost look like soldiers there!",
  "I'm proud of you, Marines!",
  "Marines, we are going to aid Master Chief after he just saved your sorry asses!",
  "Ah, man, I just had the thing washed!",
  "You're almost a man!",
  "Who's the man?",
  "Thank you!",
  "Just you and me now.",
  "One down, 50 billion to go!",
  "Do I owe you money?! ",
  "Sorry, soldier",
  "Don't get cocky!",
  "Where are your glasses, boy?",
  "Stop whining!",
  "We did bring enough ammo to kill these things!",
  "No peeking!",
  "Headshot!",
  "We could use your help, sir!",
  "I'm too pretty to die!",
  "Don't make me take off my belt!",
  "I would have been your daddy but the dog beat me over the fence!",
  "Earth isn't going to save itself, Chief, it's time to step up to the plate, are you, or are you not going to finish the fight?",
  "Lets go!",
  "Fan out and search!",
  "All quiet",
  "Punch it!",
  "Pedal to the metal!",
  "Covering fire!",
  "I can't get a clear shot!",
  "Move!",
  "Get out of my way!",
  "Get the lead out Marines!",
  "Hey, move your ass!",
  "Triggers down, men!",
  "Sorry about that sir",
  "Can't run...",
  "Next",
  "Come on!",
  "Keep it up!",
  "Its down!",
  "We showed them",
  "Nice shot!",
  "Here comes more!",
  "Target down!",
  "Which one of you freaks is next?!",
  "What the..?",
  "Over here",
  "Die!",
  "Want some more?!",
  "One alien down",
  "There it is",
  "Good shooting!",
  "Didn't even see me!",
  "Can't hide from me!",
  "Firing!",
  "Anyone see him?",
  "What's wrong with you?",
  "Somebody call Keyes and tell him what happened",
  "You nuts?",
  "That's it, you are dead!",
  "There's more where that came from",
  "He's gone rampant!",
  "Nailed him",
  "Take that, bastard!",
  "I'm on your side!",
  "Gaaaahhh!",
  "Stop!",
  "Go go go!",
  "Careful",
  "Pile out!",
  "Watch it marine",
  "Everybody out!",
  "Clean your visor",
  "Ease up son!",
  "Showtime!",
  "Lets go!",
  "Floor it!",
  "Cut it out soldier",
  "Hold your fire!",
  "Real good, jackass!",
  "What the hell?!",
  "Watch your fire, boy",
  "What the...?!",
  "Check your targets marines",
  "Hey...!",
  "Point that thing somewhere else!",
  "Bastard!",
  "Its me!",
  "Where are your glasses, boy?!",
  "Sorry.",
  "Try aiming that weapon",
  "You are all gonna DIE!",
  "Nothing over here",
  "Cease fire!",
  "Whats wrong with you, boy?!",
  "Make them count",
  "Covenant bastard!",
  "Let me get that for you!",
  "Slow it down!",
  "That will do him",
  "Don't bother getting up",
  "Class dismissed",
  "Whoooaaaaaaa!",
  "Thats how you do it, boys!",
  "Alright..!",
  "I love this JOB!",
  "That can't be all of them?",
  "Are you bored?!",
  "How that feel?!",
  "That is a guaranteed court-martial when we get back to earth, soldier",
  "We are FUBAR.",
  "Follow me, Marines!",
  "BAAAAAM!",
  "Nice throw!",
  "You are dead!",
  "Show me what you got!",
  "Who wants a piece of me?!",
  "Get cool boy!",
  "Holy crap!",
  "Look at them fly",
  "You are not getting away with that!",
  "Get him, he's a traitor",
  "Get him, he's crazy!",
  "Get him, men",
  "Die, traitor!",
  "Take him out, marines!",
  "Should i feel good about that?",
  "Well, on to plan B",
  "Take that, traitor!",
  "Stupid, stupid, stupid!",
  "Lousy piece of crap!",
  "What went wrong?",
  "Only one thing left to say...",
  "Come out where i can see you",
  "I know it's around here, somewhere",
  "I will trust you, for now",
  "I know you are there",
  "I don't want an more trouble from you",
  "Damn, i lost him",
  "Where did he go?",
  "I'm keeping my eye on you?",
  "Come out where I can see you!",
  "Don't try that again!",
  "AAHH?",
  "WHOA!",
  "What the...?",
  "AYYYY...!",
  "Are you trying to kill us?!",
  "AH..AHH...YAAA!",
  "Get it off....someone get it off!",
  "YYAAA...!",
  "UU..AAAA!",
  "That, or you can hide behind me. You done with my boy here Master Guns? I don't see any training wheels.",
  "Sorry Guns, classified.",
  "Well, he's in a particularly fine mood. Maybe Lord Hood didn't give him an invitation.",
  "Earth... Haven't seen it in years. When I shipped out for Basic, the orbital defense grid was all theory and politics. Now look! The Cairo is just one of three hundred geosync platforms. That MAC gun can put a round clean through a Covenant capital ship. With coordinated fire from the Athens and the Malta, nothing's getting past this battle cluster in one piece. Ships have been arriving all morning. Nobody's saying much, but I think something big's about to happen.",
  "And you told me you were gonna wear something nice.",
  "Folks need heroes chief, to give 'em hope, so smile would ya, while we still got something to smile about!",
  "I need a field of fire on that bulkhead. As soon as that door opens, let 'em have it!",
  "Come on, Chief, this way!",
  "Get going. I'll cover the Commander.",
  "For a brick... he flew pretty good.",
  "Dear Humanity... We regret being alien bastards. We regret coming to Earth. And we most definitely regret that the Corps just blew up our raggedy-ass fleet!",
  "We're going in. Get tactical, Marines!",
  "Shake it off, Marines. Clear the crash site! Go, go, go!",
  "I don't wanna kill ya, you're just too ugly to let live!",
  "We got Jackals in the courtyard!",
  "Copy that. Someone get a Satchel on the gate!",
  "Stand back, Marines. Let the Chief show you how it's done!",
  "Understood. I'll keep an eye on 'em. Chief ... good luck.",
  "You had your chance to be afraid before you joined my beloved Corps. But to guide you back to the true path, I brought this motivational device. Our big green style cannot be defeated!",
  "The Chief is gonna jump in this tank, roll across the bridge, and blow up any inhuman-son-of-a-bitch dumb enough to get between him and the Prophet of Regret! Pull yourself together, because you're going with him!",
  "When I joined the Corps, we didn't have any fancy-shmancy tanks. We had sticks! Two sticks, and a rock for the whole platoon - and we had to share the rock! Buck up, boy, you're one very lucky Marine!",
  "Usually the good Lord works in mysterious ways. But not today! This here is sixty-six tons of straight up, H-E-spewing dee-vine intervention! If God is love, then you can call me Cupid!",
  "We've all run the simulations, they're tough, but they ain't invincible. Stay with the Master Chief, he'll know what to do.",
  "Oh, I know what the ladies like...",
  "That's right, you mothers! Run!",
  "I'm good. Chief?",
  "Say what?!",
  "I hear ya. Starting our approach - hang tight.",
  "I got a good view comin' in. There's a big building in the middle of this island's lake.",
  "I heard that, jackass!",
  "I'll bet the Covenant are thinkin' the exact same thing.",
  "*Grunts* You know, your father never asked me for help, either!",
  "We got trouble.",
  "How ya' doing?",
  "Go, go, go!",
  "Listen, you don't like me, and I sure as hell don't like you. But if we don't do something, Mr. Mohawk's gonna activate this ring, and we're all gonna die.",
  "Well, I just happen to have a key! Come on, grab a Banshee and give me some cover. He's gonna know we're comin'.",
  "Ha! How do you like it?!",
  "Hey, bastard! Knock! Knock!",
  "Please... don't shake the lightbulb!",
  "If you want to keep your brain inside your head, I'd tell those boys to chill!",
  "Go ahead, do your thing.",
  "Hang tight, ma'am! Not until that Brute is dead!",
  "Hey, Mohawk! How'd that feel?",
  "His shield is down, let 'im have it!",
  "Got his shield! Hit him now!",
  "Quick while his shield is down!",
  "Come on, Arbiter! Kick that guy's ass!",
  "I can keep his shield down, but you've gotta finish the job!",
  "Listen Tinker Bell, don't make me....",
  "If you didn't want your ass shot off, you shouldn't have stuck it out so far",
  "Yes, we know I'm pretty, but we gotta get back to work.",
  "That hurts, Chief. That hurts real bad.",
  "I'm not your daddy.",
  "I thought we were friends.",
  "Don't make me take off my belt!",
  "Don't touch my belt!",
  "Don't look at me, look at them!",
  "Thank you.",
  "You do know I was kicking ass with that?",
  "I thought we were friends!",
  "Very funny, Cortana. Now turn him back on.",
  "Do I look like an eight-foot-tall alien monster?.",
  "Chief you are suppose to be setting an example!",
  "Chief, you've been through worse.",
  "I'm too pretty to die!",
  "I don't wanna kill ya, you're just too ugly to let live!",
  "Looks like your freaky, little mouth just bit off more than it could chew!",
  "Don't they teach you kids how to swear in basic any more?!",
  "Don't make me rip your arms off and beat you to death with them!",
  "I knew we were friends but DAMN!",
  "You okay with this, Cortana?",
  "Who's the Man?",
  "If it were anybody else...",
  "Stay sharp!",
  "Radio for VTOL, heavy lift gear. We're not leaving him here.",
  "Crazy fool! Why do you always jump? One of these days, you're gonna land on somethin' as stubborn as you are! And I don't do bits and pieces!",
  "Where is she, Chief? Where's Cortana?",
  "Make it quick, we've got to move.",
  "'What's an aspect ratio?' It's the shape and proportion of your screen, fool!",
  "Kick off the training wheels, Corporal. He's good to go.",
  "Chief, wait! The Arbiter's with us!",
  "Come on now, We got enough to worry about without you two tryin' to kill each other!",
  "Then they must love the smell of green.",
  "Then they must love the smell of hero.",
  "Then they must love the smell of bad ass.",
  "Then they must love the smell of bad ass. And I left a little present for you, Arbiter. And I'm walking away. Ha-ha-ha!",
  "Then they must love the scent of testosterone.",
  "Then they must love the scent of a real man.",
  "Then they must love the smell of Bvlgari. Yeah, I'm doing a little product placement! I gotta get paid, too!",
  "First Squad, you're my scouts. Move out! Quiet as you can.",
  "First Squad, you're my scouts. Arbiter, watch the Chief's back. Move out! Quiet as you can.",
  "First Squad, you're my scouts. As for you, just try not to wreck my planet. Move out! Quiet as you can.",
  "Let's get moving, Chief. Come on, I'll lead you out.",
  "Bravo Team, this is Johnson. We got him. Fall back to the extraction point. Over.",
  "Say again, Gunny? You're breaking up.",
  "We stick together, we're gonna get spotted. We'll split up, and meet back at the LZ. Chief, go with the Arbiter, head toward the river. Second Squad, you're with me.",
  "Chief, you and the Arbiter head toward the river.",
  "Keep an eye out for Bravo Team, Chief! If the Brutes do have our scent, those boys are in a lot of trouble!",
  "Pelicans are en route, Chief, but I can't reach Bravo. If you find 'em, get 'em to the extraction point.",
  "Chief, Pelicans are at the river. We've got company, so hustle up!",
  "Get a hold of her!",
  "Chief, can you hear me?...(static) My bird's down. Half a klick -(static)- downriver from your position.",
  "Come on, you dumb apes! You want breakfast? You gotta catch it!",
  "This isn't as fun as it looks. Cut the power!",
  "We're even, as long as we're only counting today. Kilo 023, what's your ETA?",
  "Roger that, Hocus. Friendly gunship, coming in hot!",
  "Hocus! Phantom!",
  "C'mon Chief, Commander Keyes is waiting!",
  "Come on Chief! The world won't save itself!",
  "Do you or do you not want to finish the fight?",
  "Napping. Out back.",
  "Cocky bastard. Just loves to run his mouth!",
  "Arbiter and I will guard the Ops Center. Don't worry about the Commander, Chief. I got her. But the Marines downstairs could use your help.",
  "Chief, move out. You too, Arbiter. The Commander will brief you as you go.",
  "Chief, Ops Center. Double time! The Brutes are pressing hard.",
  "Come on Chief, hustle on back!",
  "Brutes have taken the barracks. Marines are trapped inside. Those apes ain't much for mercy, Chief. We both know what they do to prisoners. Get to the barracks, save those men. Then escort them to the Landing Pad for evac.",
  "I'll guard the bomb Chief, get yourself to the Barracks.",
  "Commander, we lost the Ops Center. Brutes attacked in force. Couldn't hold them off. We're falling back to the hangar. But don't wait for us.",
  "Brutes. In the Ops Center. They disarmed the bomb. Sorry Commander, there were too many. Even for me.",
  "Chief, follow the service tunnel to the Motor Pool.",
  "Head through the Motor Pool to get to the Ops Center.",
  "We got your exit. A service elevator in the hangar. Head downstairs, cut through the caves!",
  "South hangar, straight through the caves Chief.",
  "There isn't much time, Chief. Find that elevator.",
  "Bomb's about to blow! Go, go, go!",
  "Get on the elevator, Chief! You're out of time!",
  "Keep pushing to the town of Voi, Chief. Resupply birds will meet you in the next valley.",
  "Watch it now, Pelicans coming in! Brutes have plenty of armor between here and Voi Chief, but this Warthog should help you punch on through.",
  "Chief, the gate to Voi is dead ahead. Smash the Brute blockade, open her up!",
  "That-a-way, Chief! Target destroyed. Move to the next area, over.",
  "We’ve got Anti-Air Wraiths in the next lake bed, Chief!",
  "Both AA Wraiths have been neutralized...standby. Something big, closing in on your location.",
  "Scarab! Find some cover. Now!",
  "Its armor's too thick!",
  "Aim for its legs, Chief!",
  "Jump on top of it Chief, just like New Mombasa.",
  "Look for something big...power core, something like that.",
  "Look for the core, Chief. You'll know it when you see it.",
  "One more target, Chief. There’s a Covenant AA gun in the next area. Take it down and Lord Hood can start his attack run.",
  "Chief, that gun’s been firing non-stop: it’s gotta be running hot! It’s gonna be opening up its access panel!",
  "Wait till it opens up, vents its excess plasma. Shove some lead down its throat!",
  "It's Cortana, Chief! She's on that ship! Find her - get her out!",
  "Roger that, Ma'am! We're on him!",
  "Enjoy it while you can, Marines. Soon as we land, we're right back to it. Priority one: Secure a Landing Zone for the Commander's Frigate. Keep your eyes and ears open. We need all the Intel we can get... on wherever the hell we are.",
  "Come on Chief, move ahead. Go, go, go!",
  "Ma'am, Hocus almost got her wing shot off. But we spotted a structure on the other side of this wall. It matches Cortana's description of the map room from the first Halo ring.",
  "Roger that. Follow my Pelican, Chief! The LZ's this way.",
  "That did it. LZ's clear. Commander? Bring her down",
  "Yes, ma'am; just on the other side of that wall. But it's surrounded by Brute heavy armor.",
  "A structure on the other side of that wall, ma'am. But it's surrounded by Brute heavy armor",
  "Alright then, you heard the lady.",
  "A tank's a tank, light-bulb. Pick one, Chief. Get back to the wall. I'll help the Commander secure the Dawn. Then we'll meet you at the Cartographer.",
  "Mount up - let's roll!",
  "We'll go along Chief, you check the upper floor. Make sure we have a path through the wall!",
  "Chief! Get back up there and make sure we have a clear path through the wall.",
  "Heads up, Marines! We got trouble.",
  "Infantry on the spire! Mop 'em up!",
  "Chief, you got a whole mess of hostile air inbound. Get back inside while we take 'em out.",
  "ETA: damn quick! Standby for pickup!",
  "I got it!",
  "Oh, yeah? And what might that be?",
  "Ma'am, we're on the ground. Third Tower in sight.",
  "Brute reinforcements, ma'am (static)! We're pinned down!",
  "Negative! Fire's too heavy! (to his squad) Everyone fall back! Now! (static and cut-off)",
  "That the best you got?",
  "Oh, come on. Impress me.",
  "What's the matter, big shot? Can't start your own party?",
  "Do it. Me... Then you... Now!",
  "No!",
  "Stop the rings. Save the rest.",
  "I can barely keep hold of her, Chief! No way I could pick you up! Head back to the lift... Find a way down!",
  "Chief, I'll round up our survivors, fall back to the Dawn.",
  "Arbiter will do the same with the Elites.",
  "The Shipmaster will do the same with the Elites.",
  "Yes, ma'am. I'll land her as close to the control room as I can.",
  "Roger that. And ma'am, It's good to have you back.",
  "I got you covered, Chief. Meet you at the top of that tower.",
  "Careful, I can't cover you on the far side.",
  "Keep moving, Chief. I've got your back.",
  "Flood are crawling all over that tower; watch yourself.",
  "Spark? You in there? Open the damn door!",
  "Open up! Coast is clear.",
  "Hurry! Control Room's close!",
  "I'm not gonna lose her too.",
  "We don't have a few more days!",
  "Deal with it.",
  "Not for long!",
  "Kick his ass.",
  "No... no you're not.",
  "Don't - don't let her go. Don't... ever let her go. (Coughs) Send me out... with a bang.",
  "Ain't I supposed to be immune to this?",
  "Hey Luke Duke, slow it down!",
  "Friggin tourists!",
  "Don't worry...I know what the aliens like.",
  "It has access to the Covenant battle-net?",
  "The Brutes. The bastards who put bombs on your buddies and killed millions of my people...they're digging a mighty big hole. You're gonna tell me exactly what they're looking for. And then, you're gonna help me stop 'em.",
  "Welcome to New Mombasa.",
  "Bip, bap, bam!",
  "This is Firefight. And we need every able body we can get. Even yours.",
  "You boys can thank me later, right now I got selling to do... Lucky for you, your squad is the best of the best: Orbital Drop Shock Troopers.",
  "Problem is we got alien bastards in our house. Each new wave means more bad guys. 5 waves make up a round. 3 rounds in a set. Sounds easy huh? WRONG!",
  "See these skulls? When they activate, they turn a casual Covenant make out session, into a full on test of your manly prowess.",
  "Catch, makes the enemy toss grenades like it's going out of style.",
  "Black Eye, only way you're getting health back is by punching an alien in the chin.",
  "And the others...well, let's just say that they call them difficulty multipliers for a reason.",
  "But, as long as your feeling cooperative, there's no need to go it alone. Get cozy with up to four players over System Link or Xbox Live and Firefight with your friends through ten battlefields all over New Mombasa.",
  "Well, it's not just about greasing bad guys. Sometimes, it's all about the glory. Put your boot up enough alien backside and the corps will pin rows of medals on your chest. Might even get some achievements, too. Bad ass, unlocked.",
  "Now, I know what your thinking: 'Sergent Major Johnson, these sound like overwhelming odds. I don't want to drop into hell without an air tight insurance policy!'",
  "Well, do I have an offer for you! Pre-order your copy of Halo 3: ODST at participating retailers now and you'll get all the confidence you'll need: ME!",
  "Ha ha, that's right. The toughest, cigar chompest marine there is, yours to play in Firefight.",
  "Sticky-icky!",
  "Son, I could be your daddy, but... Never mind...",
  "I can pretty much guarantee that at least one of us will make it outta here in one piece",
  "Reloading!",
  "This is how a man reloads!",
  "Dead before you hit the ground.",
  "Headshot!",
  "Bam!",
  "Boom! Headshot!",
  "That's two for flinching!",
  "Scratch another one.",
  "Nail that sucker!",
  "Nailed him.",
  "Yeah, you're dead.",
  "Take it, you Covie bastard!",
  "Savor it.",
  "Oh yeah!",
  "It's the little things...",
  "Add another one to the Johnson pile.",
  "Dance, sucker!",
  "Tango down!",
  "The only good bug is a dead bug.",
  "Now that was alright!",
  "I'm reloading!",
  "Stay low like I said so!",
  "Think about THAT while you're sittin' on your dead ass!",
  "Damn right it's personal!",
  "Badass unlocked!",
  "I know what the dead alien scum like.",
  "I love the smell of burnt alien.",
  "Oh, this is gonna be so good!",
  "Gold isn't as tacky, but, it'll do.",
  "Tell me, does this gun go with my hat?",
  "This is for Harvest!",
  "Oh, ho! Now I'm mad!",
  "There's plenty more for ya!",
  "Time to die, you son-of-a-bitch!",
  "I got your number, you dumb bug.",
  "You picked the wrong marine to muck with!",
  "Have I got an offer for YOU!?",
  "Count to five and watch'em fry.",
  "That's it, make room!",
  "I won't ever let this go!",
  "Close your eyes!",
  "Seeing red?",
  "Gonna make a whole lotta noise!",
  "Let's get dangerous!",
  "Get out the way!",
  "Spank you!",
  "You might wanna step REAL clear",
  "Sergeant Major Avery Junior blow-the-hell-outta-your-alien-ass Johnson! Reporting for duty!",
  "Ah... that's what I'm talking about.",
  "Something is gonna get real blown up!",
  "Hey! Come here a sec...",
  "Don't wanna mess with THIS Sergeant Major!",
  "Pedal to the metal, go!",
  "Let's ride!",
  "No, you weren't dreaming; it's really me. You might remember me from Halo 1, 2 and 3!",
  "We ain't gonna to let 'em take Reach. What we will let 'em have is a belly full of lead and a pool of their own blood to drown in! Am I right, SPARTAN!?",
  "Time to pop the top on this can of woop-ass",
  "A day without killing, is like a day without sunshine",
  "Yeah, keep an eye on me soldier, I'm about to put on an ass-kicking clinic.",
  "When I joined the Corps, we didn't have any fancy-smancy guns; we had sticks! TWO sticks, and a rock for the whole platoon! And we had to share the rock. Buck up, boy.",
  "And I'm walking away!",
  "The Flood? Hell, Chief, it's going to take more than that pack of walking alien horror-show freaks to take out Sergeant A. J. Johnson!",
  "Those Covenant sissies are going to have to tango with me before they set one foot in this room!",
  "That doesn't look like an Uneven Elephant to me: looks more like two squids kissing.",
  "Help me with the lady, she weighs more than your last girlfriend.",
  "You better get it together, Marine, or the Chief'll reach down and pull you inside out by your corn hole. And that'll be a sweet, sweet mercy... compared to what I'm gonna do to you.",
  "(Shrieks)",
  "(Brief maniacal laughter)",
  "Here we go, next wave coming in! This is going to get hot!",
  "Get out of here!",
  "So. You beat the Halo demo. Not bad, soldier, not bad at all. But are you ready to take the next step?! In the full version of Halo, you'll find additional vehicles like tanks, plasma turrets, and aircraft: powerful, new human and alien weapons; a single player campaign spanning ten massive indoor and outdoor environments; and support for intense multiplayer battles with up to sixteen of your friends! ... Or enemies. All that wrapped up in an epic sci-fi story that's so freaky, it makes me shake just thinkin' about it. Halo: Combat Evolved. Buy one! Heck, buy two. That's an order, soldier!",
  "Kill that S.O.B.",
  "That's how you do it, boys",
  "Rot in HELL!",
  "Move it, move it!"
]
