[
  "Greetings. I am the Monitor of Installation 04. I am 343 Guilty Spark. Someone has released The Flood. My function is to prevent it from leaving this Installation. But I require your assistance. Come. This way.",
  "Alas, activating Halo will end all sentient life in the galaxy.",
  "Puzzling. You brought such ineffective weapons to combat the Flood, despite the containment protocols.",
  "The Flood must not escape the Installation. They would consume all.",
  "You can see how the body's been transformed by the genetic restructuring of the Flood infection. The small creatures carry spores that cause a host to mutate. The mutated host then produces spores that can pass the Flood to others. It is insidious and elegant. As long as any hosts remain, the Flood is virulent.",
  "May I suggest that you upgrade to at least a Class-Twelve combat skin? Your current model only scans as a Class-Two, which is ill-suited for this kind of work.",
  "These Sentinels will supplement your combat system, but only for a short time. Speed is of the essence.",
  "Your environment suit should serve you well when the Flood begins to alter the atmosphere. You are a good planner.",
  "The installation was well-conceived. It is surely the only way to end the Flood threat.",
  "I would conjecture that the other species' currently on the installation is responsible for releasing the Flood. They seem most persistent in their attempts to access restricted areas.",
  "Why naturally the Flood is simply too dangerous to release, and mass sterilization protocols may again need to be enacted. Of course, samples were kept here after the last catastrophic outbreak... For study. It seems... That decision may have been an error.",
  "The installation was specifically built to study and contain the Flood. Their survival as a race was dependent upon it. I am grateful to see that some of them survived to reproduce.",
  "The Flood are already hard at work repairing your vessel. Its parasitic nature belies the Flood's intelligence.",
  "You may now retrieve the Index.",
  "Protocol requires that I take possession of the Index for transport. Your organic form renders you vulnerable to infection. The Index must not fall into the hands of the Flood, before we reach the Control Room and activate the installation.",
  "...which means that any organism of sufficient mass and cognitive capability is a potential vector.",
  "...Unfortunately, my usefulness to this particular endeavor has come to an end. Protocol does not allow units with my classification to perform a task as important as the reunification of the Index with the Core. That final step is reserved for you, Reclaimer.",
  "A construct? In the Core? That is absolutely unacceptable!",
  "What impertinence! I shall purge you at once!",
  "More or less. Technically, this installation's pulse has a maximum effective radius of twenty-five thousand light years. But, once the others follow suit, this galaxy will be quite devoid of life, or at least any life with sufficient biomass to sustain the Flood. But you already knew that... I mean, how couldn't you?",
  "Last time, you asked me, if it was my choice, would I do it? Having had considerable time to ponder your query, my answer has not changed. There is no choice. We must activate the ring.",
  "If you are unwilling to help, I will simply find another. Still, I must have the Index. Give your construct to me, or I will be forced to take her from you.",
  "So be it. Save his head. Dispose of the rest.",
  "Ridiculous! That you would imbue your warship's AI with such a wealth of knowledge. Wouldn't you worry that it might be captured? Or destroyed?",
  "You can't imagine how exciting this is! To have a record of all our lost time-human history, is it?. Oh, how I will enjoy every moment of it's categorization. To think that you would destroy this installation, as well as this record... I am shocked. Almost too shocked for words.",
  "Why do you continue to fight us, Reclaimer? You cannot win! Give us the construct, and I will endeavor to make your death relatively painless and—",
  "Hello. I am 343 Guilty Spark. I am the monitor of Installation 04.",
  "More Questions? Splendid. I will be happy to assist you!",
  "This mining facility predates Installation Alpha by several hundred years. It was retrofitted to research possible offensive and defensive measures against the Flood. Indeed, I designed and oversaw the construction of this facility's various outbreak management systems.",
  "The cable on top of this mine was designed as a fail-safe in case an outbreak took place. I am glad someone had the foresight to cut it!",
  "The tether connecting the mine to the high-altitude suspension grid was the primary failsafe. I am glad that someone was aware of the necessary protocols and severed the tether locally.",
  "The Flood will not survive once this mine descends into the liquid hydrogen core of the planet. Then again, neither will we. What a pity...",
  "Oracle? Great Journey? Why do you meddlers insist on using such inaccurate verbiage?",
  "Please use caution! This reclaimer is delicate.",
  "Weapons of last resort. Built by the Forerunners to eliminate potential Flood hosts, thereby rendering the Parasite harmless.",
  "After exhausting every other strategic option, my creators activated the rings. They, and all additional sentient life within three radii of the galactic center, died, as planned. Would you like to see the relevant data?",
  "Charging sequence initiated. Primary generators coming online.",
  "Apology. Protocol does not allow me to interfere with any aspect of this sequence.",
  "Under more controlled circumstances, I would suggest the Reclaimer simply remove the Index.",
  "Reclaimer, please understand that interrupting the wave generation process will severely damage this installation.",
  "Firing sequence initiated. And may I say, Reclaimers, it has been a pleasure to serve you both. Goodbye.",
  "Communicating. At superluminal speeds with a frequency of—",
  "Fail-safe protocol. In the event of unexpected shutdown, the entire system will move to standby status. All remaining platforms are now ready for remote activation.",
  "Don't be ridiculous.",
  "Why the Ark, of course.",
  "Reclaimer.",
  "We must act quickly before your construct suffers any further trauma!",
  "If we do not take this device to a safe location, somewhere I can make repairs...",
  "Protocol dictated my response! She had the Activation Index and you were going to destroy my installation. You did destroy my installation. Now, I only have one function: to help you, Reclaimer, as I always should have done.",
  "Uncertain. This storage device has suffered considerable trauma. It's matrices are highly unstable.",
  "Success!",
  "Shall I help you choose a vehicle, Reclaimer? This one seems in very good condition, primitive armor notwithstanding.",
  "I beg your pardon? I am 343 Guilty Spark, Monitor of Installation 04.",
  "Please, use caution; avoid collateral damage! While this facility appears quite durable on the surface, no doubt, there are delicate facilities below the façade. Odd, for a door to require such brute-force security protocols. One moment, Reclaimer...",
  "Sudden clarity! These Sentinels were trying to deny access to the lower levels of this facility. A wise decision, giving the Meddler's preference for destructive acquisition.",
  "It appears I have crossed a circuit.",
  "I did not want you to come to any harm.",
  "218 light years from the galactic center, to be precise.",
  "I always assumed it was part of a... shield installation, but it seems I was mistaken.",
  "Not at all. While I had a complete understanding of Installation 04, my Makers wisely limited my knowledge of all other strategic facilities. Compartmentalization - in case was ever captured, by the Flood.",
  "Near one of the Ark's superluminal communication arrays, I'm afraid. Unfortunate. The Meddler had triggered a barrier—a defensive perimeter around the Ark's core...",
  "The barrier will be difficult to disable... How odd that my Makers would place such a comprehensive defense around a single— Oh, my.",
  "We must get past that barrier! Or the Meddler will destroy all!",
  "The Ark is out of range of all the active installations! Priority: We must contain this outbreak before—",
  "Calamity! If only we had more time!",
  "Just now, but... I had my hopes. What will you do?",
  "...Then, we are agreed! A tactical pulse will completely eradicate the local infestation! I will personally oversee the final preparations.",
  "Oh, hello. Wonderful news. The Installation is almost complete.",
  "Yes... isn't it? I have begun my simulations. No promises, but initial results indicate that this facility should be ready to fire in just a few more days!",
  "But, but, but... a premature firing will destroy the Ark!",
  "You'll destroy this Installation...",
  "Unacceptable! Unacceptable! Absolutely unacceptable!",
  "Protocol dictates action! I see now that helping you was wrong!",
  "You are the child of my Makers. Inheritor of all they left behind. You are Forerunner! But this ring... is mine!",
  "My eye... do you mean to blind me?",
  "Do you not want your inheritance, Reclaimer?"
]
